hathach/tinyusb/src/portable/wch/dcd_ch32h417_usb30.c
/*
 * SPDX-FileCopyrightText: Copyright (c) 2026 Ha Thach (tinyusb.org)
 * SPDX-License-Identifier: MIT
 *
 * This file is part of the TinyUSB stack.
 */

// USB3.0 SuperSpeed device driver for the WCH CH32H417/CH32H416 USBSS controller
// (@0x40034000), documented in CH32H417RM-EN chapter 27. The LINK layer is the same IP as the
// CH569 (dcd_ch56x_usb30.c) but the endpoint engine is a reworked chain-DMA design with
// hardware sequence numbers and ERDY (SEQ_AUTO / ERDY_AUTO), per-endpoint persistent halt
// (RB_EP_TX/RX_HALT), and per-chain completion flags. Software drives the LTSSM through the
// USBSS_LINK interrupt. The init/PHY/LINK/EP0 register sequences are transcribed from the WCH
// EVT USBSS device demo; IN transfers ride whole multi-packet chains (see queue_in_packet), OUT
// arms one packet at a time. Buffers may live anywhere in the shared SRAM (all DMA-reachable).
//
// No SOF at SuperSpeed: dcd_sof_enable() is a no-op, so tud_sof_cb and the audio-class feedback
// path get nothing even though iso endpoints are supported. The received bus interval counter is
// readable (R32_USBSS_ITP.REG_ITP_INTERVAL, RM 27.2.2.1, +1 every 125 us), but the only ITP
// interrupt is host mode's "transmit ITP complete" (RB_UIE_ITP / RB_UIF_ITP, RM 27.2.1.1 /
// 27.2.1.2), so a device-mode SOF event would have to be polled rather than serviced from the ISR.
//
// With CFG_TUD_WCH_USB30_FALLBACK this dcd owns both controllers: it counts failed SuperSpeed
// training attempts (LINK DISABLE/INACTIVE) with a TIM12 backstop and hands rhport 0 to the USB2
// driver (ch32h417_usb2_* in dcd_ch32h417_usbhs.c) when the host has no SuperSpeed port.
//
// NOTE: compile-verified; full hardware bring-up (usbtest at 5 Gbps) is pending.

#include "tusb_option.h"

#if CFG_TUD_ENABLED && defined(TUP_USBIP_WCH_USB30_H417) && \
    defined(CFG_TUD_WCH_USBIP_USB30) && CFG_TUD_WCH_USBIP_USB30 == 1

#include "device/dcd.h"
#include "dcd_ch32h417.h"
#include "ch32h417_usb30_reg.h"

#define EP_MAX          8
#define EP0_MAX_SIZE    512

#ifndef CFG_TUD_WCH_USB30_MAX_BURST
#define CFG_TUD_WCH_USB30_MAX_BURST 1
#endif

typedef struct {
  uint8_t *buffer;
  uint16_t total_len;
  uint16_t queued_len;
  uint16_t armed_len; // bytes in the IN chain armed last (rewind unit for clear-halt)
  uint16_t max_size;
  bool     is_iso;
  bool     valid;
  bool     bounce; // OUT armed into the bounce buffer (user buffer smaller than one packet)
} xfer_ctl_t;

#define XFER_CTL_BASE(_ep, _dir) (&xfer_status[_ep][_dir])
static xfer_ctl_t xfer_status[EP_MAX][2];

// EP0 buffer in shared SRAM (DMA-reachable); SETUP lands here.
TU_ATTR_ALIGNED(16) static uint8_t ep0_buffer[EP0_MAX_SIZE];

// The RX chain engine has no receive-length limit: an armed packet writes up to max_size bytes at
// UEP_RX_DMA (the vendor demo only ever DMAs into full-size dedicated buffers). Receive into this
// bounce buffer whenever the user buffer cannot hold a whole packet (e.g. MSC's 31-byte CBW at
// 1024-byte SS bulk MPS - zero-copying that sprayed ~1 KB over .bss and crashed usbd).
TU_ATTR_ALIGNED(16) static uint8_t rx_bounce[EP_MAX - 1][1024];
// EP0 DP packet-sequence numbers, one per direction. EP0 has no SEQ_AUTO (RM 27.2.2.5/27.2.2.6:
// the field only auto-clears on SETUP), so software owns them - and they count over the WHOLE data
// stage, which usbd hands down in one-max-packet chunks (CFG_TUD_ENDPOINT0_BUFSIZE), so they cannot
// live in the per-chunk xfer state nor be recovered from the register between chunks.
// volatile: both are read-modify-written from the ISR (arm on completion) and from task context
// (arm on the usbd xfer that starts the next chunk of the same data stage).
static volatile uint8_t ep0_tx_seq; // EP0 IN sequence number [4:0]
static volatile uint8_t ep0_rx_seq; // EP0 OUT next expected sequence number [4:0]
static uint8_t pending_addr;
static bool    pending_addr_valid;

// SuperSpeed retrain rate-limiting (see link_backoff_arm)
static uint8_t retrain_fail;
static volatile bool backoff_armed;
static void link_backoff_arm(void);

// the link entered U1/U2/U3 with the low-power PHY config applied (restored on RECOVERY)
static volatile bool link_low_power;

// the link entered U3 (USB suspend), distinct from the U1/U2 low-power link states: only a U3
// exit must produce DCD_EVENT_RESUME (a U1/U2 exit is not a USB resume)
static volatile bool link_suspended;

// the link enumerated (LMP Port Config exchanged / reached U0): a later drop to DISABLE/INACTIVE
// is a real disconnect, whereas the same states during initial training are just retrain attempts
static volatile bool link_established;

// Set when UDIF_STATUS fires with no zero-length EP0 transfer queued yet: the controller ran the
// status stage on its own before usbd got around to arming it (the host pipelines control
// transfers faster than the task loop runs). The late arm then completes immediately instead of
// touching the hardware - a stale EP0 arm would linger into the next control transfer and break it.
static volatile bool ep0_status_done;

// NOTE: the vendor stack services a SETUP synchronously inside the ISR and holds USBSS_UDIF_SETUP
// until the response is armed; usbd defers the response to task context instead. No hold is
// needed: the controller NRDYs the host's data/status requests while EP0 is unarmed and announces
// the late arm itself (validated on hardware: full usbtest battery incl. 1000x ch9 control stress
// and ~75k control transfers, zero failures).

//--------------------------------------------------------------------+
// Runtime USB2 fallback state
//--------------------------------------------------------------------+
#if CFG_TUD_WCH_USB30_FALLBACK
enum { FB_USB3_TRAINING, FB_USB3_UP, FB_USB2_ACTIVE };
static uint8_t fb_state;
static uint8_t fb_fail_count;
#define FB_FAIL_LIMIT 3

static void usbss_device_init(bool enable);
static void fallback_timer_start(bool enable);

// Shut the SuperSpeed controller down and bring the USB2 high-speed controller up on rhport 0.
// Must stop TIM12 first: once fb_state==FB_USB2_ACTIVE, dcd_int_handler routes every IRQ to the
// USB2 handler and never clears the TIM12 flag, so a still-running timer would storm the CPU.
static void fallback_to_usb2(uint8_t rhport) {
  fallback_timer_start(false);
  usbss_device_init(false);
  fb_state = FB_USB2_ACTIVE;
  ch32h417_usb2_init(rhport);
  ch32h417_usb2_int_enable();
}
#endif

//--------------------------------------------------------------------+
// PHY / clock / link bring-up (transcribed from the WCH EVT USBSS demo)
//--------------------------------------------------------------------+

static void usbss_rcc_init(bool enable) {
  if (enable) {
    RCC->CTLR |= (uint32_t)RCC_USBSS_PLLON;
    // bounded, best effort: a PLL that never locks (e.g. bad HSE) must not hang the core forever
    uint32_t timeout = 1000000;
    while (((RCC->CTLR & (uint32_t)RCC_USBSS_PLLRDY) != (uint32_t)RCC_USBSS_PLLRDY) && --timeout) {}
    RCC_HBPeriphClockCmd(RCC_HBPeriph_USBSS, ENABLE);
    RCC_PIPECmd(ENABLE);
    RCC_UTMIcmd(ENABLE);
  } else {
    RCC_HBPeriphClockCmd(RCC_HBPeriph_USBSS, DISABLE);
    RCC_UTMIcmd(DISABLE);
    RCC_PIPECmd(DISABLE);
    RCC->CTLR &= ~(uint32_t)RCC_USBSS_PLLON;
  }
}

