hathach/tinyusb/src/portable/wch/dcd_ch32h417_usb30.c
static void usbss_phy_cfg(uint8_t addr, uint16_t data) {
  USBSS_PHY_CFG_CR = (1u << 23) | ((uint32_t)addr << 16) | data;
  USBSS_PHY_CFG_DAT = 0x01;
  (void)USBSS_PHY_CFG_DAT; // read-back strobe; the returned value is not used
}

static void usbss_cfg_mod(void) {
  usbss_phy_cfg(0x03, 0x7C12);
  usbss_phy_cfg(0x0D, 0x79AA);
  usbss_phy_cfg(0x15, 0x4430);
  usbss_phy_cfg(0x13, 0x0010);
  USBSS_PHY_MISC_REG = 0xB0054000;
}

static void ep_chain_init(void) {
  // RM 27.2.1.1 RB_USB_CLR_ALL: clears all interrupt flags, the device address and every endpoint
  // configuration; "in device mode this bit should be set after receiving HOT_RESET/WARM_RESET,
  // then cleared". Without the pulse a latched UDIF_SETUP survives the reset and dcd_int_handler
  // replays the stale ep0_buffer as a SETUP. The vendor's endpoint init opens with the same pulse;
  // restore the snapshot rather than read back, since the bit also resets configuration registers.
  const uint32_t usb_control = USBSSD->USB_CONTROL;
  USBSSD->USB_CONTROL = usb_control | USBSS_USB_CLR_ALL;
  USBSSD->USB_CONTROL = usb_control & ~(uint32_t)USBSS_USB_CLR_ALL;

  // EP0 buffer for SETUP/data
  USBSSD->UEP0_TX_CTRL = 0;
  USBSSD->UEP0_RX_CTRL = 0;
  USBSSD->UEP0_TX_DMA = (uint32_t)(uintptr_t)ep0_buffer;
  USBSSD->UEP0_RX_DMA = (uint32_t)(uintptr_t)ep0_buffer;
}

static void usbss_device_init(bool enable) {
  if (enable) {
    TU_LOG2("usbss: rcc/pll init\r\n");
    usbss_rcc_init(true);
    TU_LOG2("usbss: pll locked\r\n");

    // TX de-emphasis: match the WCH EVT init literal exactly (it programs both DEEMPH bits)
    USBSSD->LINK_CFG = LINK_RX_EQ_EN | LINK_TX_DEEMPH_MASK | LINK_PHY_RESET;
    USBSSD->LINK_CTRL = LINK_P2_MODE | LINK_GO_DISABLED;
    USBSSD->LINK_CFG = LINK_RX_EQ_EN | LINK_TX_DEEMPH_MASK | LINK_LTSSM_MODE | LINK_TOUT_MODE;
    USBSSD->LINK_LPM_CR |= LINK_LPM_EN;
    USBSSD->LINK_CFG |= LINK_RX_TERM_EN;
    USBSSD->LINK_INT_CTRL = LINK_IE_TX_LMP | LINK_IE_RX_LMP | LINK_IE_RX_LMP_TOUT | LINK_IE_STATE_CHG |
                            LINK_IE_WARM_RST | LINK_IE_TERM_PRES;
    USBSSD->LINK_CTRL = LINK_P2_MODE;
    USBSSD->LINK_U1_WKUP_TMR = 120;
    USBSSD->LINK_U1_WKUP_FILTER = 50;
    USBSSD->LINK_U2_WKUP_FILTER = 0;
    USBSSD->LINK_U3_WKUP_FILTER = 0;

    USBSSD->USB_CONTROL |= USBSS_FORCE_RST;
    USBSSD->USB_STATUS = USBSS_UIF_TRANSFER;
    USBSSD->USB_CONTROL = USBSS_UIE_TRANSFER | USBSS_UDIE_SETUP | USBSS_UDIE_STATUS | USBSS_DMA_EN | USBSS_SETUP_FLOW;

    usbss_cfg_mod();

    USBSSD->UEP_TX_EN = 0;
    USBSSD->UEP_RX_EN = 0;
    ep_chain_init();

    NVIC_EnableIRQ(USBSS_IRQn);
    NVIC_EnableIRQ(USBSS_LINK_IRQn);
    TU_LOG2("usbss: init done LINK_STATUS=%08lx LINK_CFG=%08lx\r\n",
            (unsigned long)USBSSD->LINK_STATUS, (unsigned long)USBSSD->LINK_CFG);
  } else {
    NVIC_DisableIRQ(USBSS_LINK_IRQn);
    NVIC_DisableIRQ(USBSS_IRQn);
    USBSSD->USB_CONTROL = USBSS_FORCE_RST;
    USBSSD->LINK_CFG |= LINK_PHY_RESET | U3_LINK_RESET;
    for (volatile int i = 0; i < 2000; i++) {}
    USBSSD->USB_CONTROL &= ~USBSS_FORCE_RST;
    USBSSD->LINK_CFG &= ~(LINK_PHY_RESET | U3_LINK_RESET);
    usbss_rcc_init(false);
  }
}

// re-init the endpoint engine after a warm/hot reset (keeps the link up)
static void usbss_reset_init(void) {
  USBSSD->USB_CONTROL |= USBSS_FORCE_RST;
  USBSSD->USB_STATUS = USBSS_UIF_TRANSFER;
  USBSSD->USB_CONTROL = USBSS_UIE_TRANSFER | USBSS_UDIE_SETUP | USBSS_UDIE_STATUS | USBSS_DMA_EN | USBSS_SETUP_FLOW;
  ep_chain_init();
  ep0_status_done = false;
  ep0_tx_seq = 0; // a bus reset resets the EP0 packet sequences
  ep0_rx_seq = 0;
  // USB 3.2 Table 9-10: a hot/warm reset clears U1/U2 Enable, so deny link low-power again
  USBSSD->LINK_CFG &= ~(LINK_U1_ALLOW | LINK_U2_ALLOW);
  // Invalidate every in-flight transfer: the reset flushes armed chains and their UIF_TRANSFERs
  // would otherwise complete as stale events into usbd AFTER it wiped the ep->driver map
  // ("Xfer Complete on EP 03" straight after "Bus Reset" -> usbd assert; seen on hardware).
  // Only the in-flight flags: a class xfer_cb interrupted by this reset re-arms from task context
  // right after, and a wiped max_size makes queue_in_packet divide by zero (TU_DIV_CEIL).
  for (uint8_t ep = 0; ep < EP_MAX; ep++) {
    xfer_status[ep][TUSB_DIR_OUT].valid = false;
    xfer_status[ep][TUSB_DIR_IN].valid = false;
  }
}

//--------------------------------------------------------------------+
// LINK layer (LTSSM) - state-change driven, transcribed from the demo
//--------------------------------------------------------------------+

static void handle_link_irq(uint8_t rhport) {
  uint32_t link_int = USBSSD->LINK_INT_FLAG;
  uint32_t link_state = USBSSD->LINK_STATUS & LINK_STATE_MASK;

  // NOTE: no logging in this handler - the LMP exchange after U0 has a ~us deadline and a
  // blocking UART print here breaks SuperSpeed training (proven on hardware).

  if (link_int & LINK_IF_STATE_CHG) {
    USBSSD->LINK_INT_FLAG = LINK_IF_STATE_CHG;

    switch (link_state) {
      case LINK_STATE_DISABLE:
        if (retrain_fail < 0xFF) {
          retrain_fail++;
        }
        if (retrain_fail >= 3) {
          link_backoff_arm(); // hold DISABLED; the timer releases GO_DISABLED in ~20 ms
        } else {
          USBSSD->LINK_CTRL &= ~LINK_GO_DISABLED;
        }
        // DISABLE and INACTIVE both count as a failed SuperSpeed training attempt
        TU_ATTR_FALLTHROUGH;
      case LINK_STATE_INACTIVE:
        if (link_established) {
          // an enumerated SuperSpeed link dropped (cable pull / host port down): report the
          // disconnect once. During initial training link_established is false, so the retrain
          // DISABLE/INACTIVE churn does not spuriously unplug.
          link_established = false;
          link_suspended = false;  // an unplugged link cannot be suspended: no stale RESUME later
          link_low_power = false;
          dcd_event_bus_signal(rhport, DCD_EVENT_UNPLUGGED, true);
        }
#if CFG_TUD_WCH_USB30_FALLBACK
        if (fb_state == FB_USB3_TRAINING && ++fb_fail_count >= FB_FAIL_LIMIT) {
          fallback_to_usb2(rhport); // host has no SuperSpeed port: bring up USB2 on rhport 0
        }
#endif
        break;

      case LINK_STATE_HOTRST:
        usbss_reset_init();
        link_suspended = false; // a reset link starts un-suspended
        link_low_power = false;
        dcd_event_bus_reset(rhport, TUSB_SPEED_SUPER, true);
        USBSSD->LINK_CTRL &= ~LINK_HOT_RESET;
        break;

      case LINK_STATE_U3:
        link_suspended = true; // only U3 is a USB suspend (U1/U2 are link low-power states)
        dcd_event_bus_signal(rhport, DCD_EVENT_SUSPEND, true);
        TU_ATTR_FALLTHROUGH;
      case LINK_STATE_U1:
      case LINK_STATE_U2:
        // low-power entry: PHY reconfig transcribed from the vendor demo. Without it the link
        // cannot exit its first U1/U2/U3 transition and the device drops off the bus ~45 s after
        // enumerating (host resumes -> no response -> error -62 -> disconnect; seen on hardware).
        link_low_power = true;
        usbss_phy_cfg(0x12, 0x67C8 & (uint16_t)~(1u << 9));
        break;

