hathach/tinyusb/src/portable/wch/dcd_ch32h417_usb30.c
      case LINK_STATE_RECOVERY:
        if (link_low_power) {
          link_low_power = false;
          // ~100 us settle before restoring the PHY (vendor: Delay_Us(100))
          for (volatile uint32_t i = 0; i < 2500; i++) {}
          usbss_phy_cfg(0x12, 0x67C8);
        }
        // emit RESUME only for a real suspend (U3) exit, not for a U1/U2 low-power exit
        if (link_suspended) {
          link_suspended = false;
          dcd_event_bus_signal(rhport, DCD_EVENT_RESUME, true);
        }
        break;

      case LINK_STATE_U0:
      case LINK_STATE_POLLING:
      case LINK_STATE_RXDET:
      default:
        break;
    }
  } else if (link_int & LINK_IF_TERM_PRES) {
    USBSSD->LINK_INT_FLAG = LINK_IF_TERM_PRES;
  } else if (link_int & LINK_IF_RX_LMP_TOUT) {
    USBSSD->LINK_INT_FLAG = LINK_IF_RX_LMP_TOUT;
    USBSSD->LINK_CTRL |= LINK_GO_DISABLED;
    USBSSD->LINK_CTRL |= LINK_GO_RX_DET;
  } else if (link_int & LINK_IF_TX_LMP) {
    USBSSD->LINK_INT_FLAG = LINK_IF_TX_LMP;
    USBSSD->LINK_LMP_TX_DATA0 = LMP_LINK_SPEED | LMP_PORT_CAP | LMP_HP;
    USBSSD->LINK_LMP_TX_DATA1 = LMP_UP_STREAM | LMP_NUM_HP_BUF;
    USBSSD->LINK_LMP_TX_DATA2 = 0;
  } else if (link_int & LINK_IF_RX_LMP) {
    USBSSD->LINK_INT_FLAG = LINK_IF_RX_LMP;
    uint32_t rx0 = USBSSD->LINK_LMP_RX_DATA0;
    if ((rx0 & LMP_SUBTYPE_MASK) == LMP_PORT_CFG) {
      // upstream port received Port Configuration: reply Port Config Response = SS training done
      USBSSD->LINK_LMP_TX_DATA0 = LMP_LINK_SPEED | LMP_PORT_CFG_RES | LMP_HP;
      USBSSD->LINK_LMP_TX_DATA1 = 0;
      USBSSD->LINK_LMP_TX_DATA2 = 0;
      USBSSD->LINK_LMP_PORT_CAP |= LINK_LMP_TX_CAP_VLD;
      retrain_fail = 0; // link trained: reset the retrain backoff
      link_established = true; // enumerated: a later DISABLE/INACTIVE is now a real disconnect
#if CFG_TUD_WCH_USB30_FALLBACK
      fallback_timer_start(false); // SS is up: stop the 0.5 s fallback backstop (mirrors CH569)
#endif
#if CFG_TUD_WCH_USB30_FALLBACK
      fb_state = FB_USB3_UP;
      fb_fail_count = 0;
#endif
      dcd_event_bus_reset(rhport, TUSB_SPEED_SUPER, true);
    } else if ((rx0 & LMP_SUBTYPE_MASK) == LMP_U2_INACT_TOUT) {
      USBSSD->LINK_U2_INACT_TIMER = (rx0 >> 9) & 0xFF;
    }
  } else if (link_int & LINK_IF_WARM_RST) {
    USBSSD->LINK_INT_FLAG = LINK_IF_WARM_RST;
    if (USBSSD->LINK_STATUS & LINK_RX_WARM_RST) {
      usbss_reset_init();
      link_suspended = false; // a reset link starts un-suspended
      link_low_power = false;
      USBSSD->LINK_CTRL |= LINK_GO_DISABLED;
      __NOP(); __NOP(); __NOP(); __NOP();
      USBSSD->LINK_CTRL &= ~LINK_GO_DISABLED;
      dcd_event_bus_reset(rhport, TUSB_SPEED_SUPER, true);
    }
  }
}

//--------------------------------------------------------------------+
// EP0 control
//--------------------------------------------------------------------+

static void ep0_arm_in(uint16_t len) {
  // Clear-first: a set ACT flag write-locks the register.
  USBSSD->UEP0_TX_CTRL = 0;
  // One store, not the vendor demo's write-then-OR-in-ERDY: the read-modify-write raced the ISR
  // (ep0_arm_in runs from both task and interrupt context), and a SETUP landing between the two
  // stores would have re-applied ERDY on top of whatever the ISR had just armed. Hardware-checked
  // that ERDY in the same store still latches DPH/len first: usbtest cases 9 (1000 control
  // transfers) and 10, multi-packet control-OUT, and 3 full suites.
  USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_DPH | len | ((uint32_t)ep0_tx_seq << 16) | USBSS_EP0_TX_ERDY;
  ep0_tx_seq = (uint8_t)((ep0_tx_seq + 1u) & 0x1Fu);
}

static void ep0_arm_out(void) {
  // Same write-lock as the TX side: while RB_UIF_EP0_RX_ACT (bit31) is set from a completed
  // receive, register writes do not stick - clear first, then arm (found on hardware: a stuck
  // RX_ACT from SET_LINE_CODING's data stage killed the status stage of every later transfer).
  // RB_EP0_RX_SEQ must be rewritten with every arm: the clear zeroes it, and an arm that expects
  // sequence 0 while the host is sending the second DP of a data stage gets NO response out of the
  // engine at all - the host sees a transaction error (usbtest ctrl_out -EPROTO above 512 bytes).
  USBSSD->UEP0_RX_CTRL = 0;
  USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_ACK | ((uint32_t)ep0_rx_seq << 16);
}

static void handle_setup(uint8_t rhport) {
  TU_LOG2("SU: %02x %02x %02x%02x %02x%02x %02x%02x\r\n", ep0_buffer[0], ep0_buffer[1], ep0_buffer[3],
          ep0_buffer[2], ep0_buffer[5], ep0_buffer[4], ep0_buffer[7], ep0_buffer[6]);
  ep0_tx_seq = 0;
  ep0_rx_seq = 0;
  pending_addr_valid = false;
  ep0_status_done = false;
  xfer_status[0][TUSB_DIR_IN].valid = false;
  xfer_status[0][TUSB_DIR_OUT].valid = false;
  // SET_ISOCH_DELAY: usbd accepts it as a stackwide no-op, but the engine times iso DPs off
  // LINK_ISO_DLY - the vendor stack forwards the host's value (RM 27.2.6.11: ns units, lower
  // 3 bits ignored, reset 40 ns). Snoop it here since usbd has no DCD hook for this request.
  const tusb_control_request_t *setup = (const tusb_control_request_t *)(uintptr_t)ep0_buffer;
  if (setup->bmRequestType == 0 && setup->bRequest == TUSB_REQ_SET_ISOCH_DELAY) {
    USBSSD->LINK_ISO_DLY = setup->wValue;
  }
  dcd_event_setup_received(rhport, ep0_buffer, true);
}

static void handle_ep0_in(uint8_t rhport) {
  xfer_ctl_t *xfer = XFER_CTL_BASE(0, TUSB_DIR_IN);
  if (!xfer->valid || xfer->total_len == 0) {
    return; // a zero-length status IN is completed by the UDIF_STATUS interrupt, not here
  }
  uint16_t remaining = xfer->total_len - xfer->queued_len;
  if (remaining == 0) {
    xfer->valid = false;
    USBSSD->UEP0_TX_CTRL = 0; // done: clear the completion flag and park the endpoint (CH569 does the same)
    // Ready the status-OUT stage right here in the ISR, before usbd even sees the completion
    // (the vendor's "ready status step"): RX idles at RES=NRDY, and a status DP that gets NRDYed
    // with no ERDY to revive it times the whole control transfer out.
    ep0_arm_out();
    dcd_event_xfer_complete(rhport, 0x80, xfer->queued_len, XFER_RESULT_SUCCESS, true);
    return;
  }
  uint16_t len = TU_MIN(remaining, (uint16_t)EP0_MAX_SIZE);
  memcpy(ep0_buffer, &xfer->buffer[xfer->queued_len], len);
  xfer->queued_len += len;
  ep0_arm_in(len);
}

static void handle_ep0_out(uint8_t rhport) {
  xfer_ctl_t *xfer = XFER_CTL_BASE(0, TUSB_DIR_OUT);
  if (!xfer->valid) {
    // A zero-length receive with nothing queued is the control-IN status ZLP arriving before usbd
    // queued it (we pre-arm the status stage in handle_ep0_in): remember it so the late queue
    // completes immediately - dropping it stalls usbd's control state and kills the NEXT transfer.
    if ((USBSSD->UEP0_RX_CTRL & USBSS_EP0_RX_LEN_MASK) == 0) {
      USBSSD->UEP0_RX_CTRL = 0; // clear RX_ACT
      ep0_status_done = true;
    }
    return;
  }
  uint16_t rx_len = USBSSD->UEP0_RX_CTRL & USBSS_EP0_RX_LEN_MASK;
  ep0_rx_seq = (uint8_t)((ep0_rx_seq + 1u) & 0x1Fu);
  uint16_t remaining = xfer->total_len - xfer->queued_len;
  uint16_t len = TU_MIN(rx_len, remaining);
  memcpy(&xfer->buffer[xfer->queued_len], ep0_buffer, len);
  xfer->queued_len += len;

