hathach/tinyusb/src/portable/wch/dcd_ch32h417_usb30.c
  if (xfer->queued_len >= xfer->total_len || len < EP0_MAX_SIZE) {
    xfer->valid = false;
    USBSSD->UEP0_RX_CTRL = 0; // done: clear RX_ACT so it cannot write-lock the next arm
    dcd_event_xfer_complete(rhport, 0x00, xfer->queued_len, XFER_RESULT_SUCCESS, true);
  } else {
    ep0_arm_out();
  }
}

//--------------------------------------------------------------------+
// Data endpoints - single chain armed per packet (burst 1)
//--------------------------------------------------------------------+

// Vendor demos arm 16-packet chains; EXP_NUMP is 8-bit but stay on silicon-proven ground.
#define TX_CHAIN_MAX_PKTS 16

static void queue_in_packet(uint8_t ep_num, xfer_ctl_t *xfer) {
  const uint16_t remaining = xfer->total_len - xfer->queued_len;
  volatile USBSS_EP_TX_TypeDef *tx = usbss_ep_tx(ep_num);

  // Whole-transfer chain arming, vendor-style: DMA_OFS is the per-full-packet stride, CHAIN_LEN
  // the LAST packet's length, EXP_NUMP the packet count (this write is the arming latch). A
  // multi-packet transfer must ride ONE chain so the engine owns intra-chain sequencing and the
  // burst closes at the chain boundary: with per-packet 1-DP chains the burst stayed open across
  // re-arms, and a DP from any OTHER armed IN endpoint emitted into that open burst came out
  // corrupt - the host answered with a transaction error (EPROTO) and the endpoint was dead
  // until the next reset (cdc_msc_throughput's streaming CDC IN wedged every short MSC response
  // into a usb-storage reset storm). No CHAIN_ST.EOB_LPF latch and no sw SEQ: a write before the
  // EXP_NUMP latch is discarded with it, one after it races the departing DP (both hw-proven).
  uint16_t npkt;
  uint16_t last_len;
  if (remaining == 0) {
    npkt = 1; // ZLP
    last_len = 0;
  } else {
    npkt = (uint16_t)TU_DIV_CEIL(remaining, xfer->max_size);
    if (npkt > TX_CHAIN_MAX_PKTS) {
      npkt = TX_CHAIN_MAX_PKTS;
      last_len = xfer->max_size;
    } else {
      last_len = (uint16_t)(remaining - (uint16_t)(npkt - 1) * xfer->max_size);
    }
  }
  tx->UEP_TX_DMA = (uint32_t)(uintptr_t)&xfer->buffer[xfer->queued_len];
  tx->UEP_TX_DMA_OFS = xfer->max_size;
  tx->UEP_TX_CHAIN_LEN = last_len;
  tx->UEP_TX_CHAIN_EXP_NUMP = (uint8_t)npkt; // arms the chain (latches the staged configuration)
  tx->UEP_TX_ST = USBSS_EP_TX_FC_ST; // clear a latched NRDY so ERDY_AUTO announces this arm
  xfer->armed_len = (uint16_t)((uint16_t)(npkt - 1) * xfer->max_size + last_len);
  xfer->queued_len += xfer->armed_len;
}

static void queue_out_packet(uint8_t ep_num, xfer_ctl_t *xfer) {
  volatile USBSS_EP_RX_TypeDef *rx = usbss_ep_rx(ep_num);
  const uint16_t remaining = xfer->total_len - xfer->queued_len;
  xfer->bounce = remaining < xfer->max_size; // see rx_bounce
  rx->UEP_RX_DMA = xfer->bounce ? (uint32_t)(uintptr_t)rx_bounce[ep_num - 1]
                                : (uint32_t)(uintptr_t)&xfer->buffer[xfer->queued_len];
  rx->UEP_RX_DMA_OFS = xfer->max_size;
  rx->UEP_RX_CHAIN_MAX_NUMP = 1; // arms the chain (latches the staged DMA/OFS into a chain slot)
  // If the host already asked while nothing was armed, the controller sent NRDY and latched
  // FC_ST - and ERDY_AUTO will not announce the new arm while it is set, deadlocking the
  // endpoint until the host gives up (~30 s SCSI timeout; MSC's request-response pattern hit
  // this on every second command while continuous streams never did). Write-1-to-clear.
  rx->UEP_RX_ST = USBSS_EP_RX_FC_ST;
}

static void handle_ep_in(uint8_t rhport, uint8_t ep_num) {
  xfer_ctl_t *xfer = XFER_CTL_BASE(ep_num, TUSB_DIR_IN);
  volatile USBSS_EP_TX_TypeDef *tx = usbss_ep_tx(ep_num);
  tx->UEP_TX_CHAIN_ST = USBSS_EP_TX_CHAIN_IF; // release completed chain (pure write: CHAIN_IF is WO, |= re-asserts stale RW bits like EOB_LPF read from the register)

  if (!xfer->valid) {
    return;
  }
  if (xfer->queued_len >= xfer->total_len) {
    xfer->valid = false;
    dcd_event_xfer_complete(rhport, ep_num | TUSB_DIR_IN_MASK, xfer->queued_len, XFER_RESULT_SUCCESS, true);
  } else {
    queue_in_packet(ep_num, xfer);
  }
}

static void handle_ep_out(uint8_t rhport, uint8_t ep_num) {
  xfer_ctl_t *xfer = XFER_CTL_BASE(ep_num, TUSB_DIR_OUT);
  volatile USBSS_EP_RX_TypeDef *rx = usbss_ep_rx(ep_num);
  uint16_t rx_len = rx->UEP_RX_CHAIN_LEN;
  rx->UEP_RX_CHAIN_ST = USBSS_EP_RX_CHAIN_IF; // release completed chain (pure write, see handle_ep_in)

  if (!xfer->valid) {
    return;
  }
  uint16_t remaining = xfer->total_len - xfer->queued_len;
  uint16_t len = TU_MIN(rx_len, TU_MIN(remaining, xfer->max_size));
  if (xfer->bounce) {
    memcpy(&xfer->buffer[xfer->queued_len], rx_bounce[ep_num - 1], len);
  }
  xfer->queued_len += len;

  if (xfer->queued_len >= xfer->total_len || len < xfer->max_size) {
    xfer->valid = false;
    dcd_event_xfer_complete(rhport, ep_num, xfer->queued_len, XFER_RESULT_SUCCESS, true);
  } else {
    queue_out_packet(ep_num, xfer);
  }
}

//--------------------------------------------------------------------+
// USB (transfer) interrupt dispatch
//--------------------------------------------------------------------+

static void handle_usb_irq(uint8_t rhport) {
  uint32_t status = USBSSD->USB_STATUS;

  if ((status & USBSS_UDIF_SETUP) && !(status & USBSS_UDIF_STATUS)) {
    USBSSD->USB_STATUS = USBSS_UDIF_SETUP;
    handle_setup(rhport);
  } else if (status & USBSS_UDIF_STATUS) {
    // Control status stage: on the H417 this is its own interrupt (SET_ADDRESS is applied here).
    TU_LOG2("ST\r\n");
    USBSSD->USB_STATUS = USBSS_UDIF_STATUS;
    if (pending_addr_valid) {
      USBSSD->USB_CONTROL = (USBSSD->USB_CONTROL & 0x00FFFFFF) | ((uint32_t)pending_addr << 24);
      pending_addr_valid = false;
    }
    USBSSD->UEP0_TX_CTRL = 0;
    USBSSD->UEP0_RX_CTRL = 0;
    // Complete the queued zero-length status transfer so usbd runs its status-stage callback
    // (the status ZLP does not raise a UIF_TRANSFER on this controller). If usbd has not queued
    // it yet, remember that the status stage already ran (see ep0_status_done).
    bool completed = false;
    for (uint8_t dir = 0; dir < 2; dir++) {
      xfer_ctl_t *x = &xfer_status[0][dir];
      if (x->valid && x->total_len == 0) {
        x->valid = false;
        completed = true;
        dcd_event_xfer_complete(rhport, (dir == TUSB_DIR_IN) ? 0x80 : 0x00, 0, XFER_RESULT_SUCCESS, true);
      }
    }
    if (!completed) {
      ep0_status_done = true;
    }
  } else if (status & USBSS_UIF_TRANSFER) {
    uint8_t ep_num = USBSS_STATUS_EP_NUM(status);
    bool is_in = USBSS_STATUS_EP_IN(status);
    if (ep_num == 0) {
      if (is_in) { handle_ep0_in(rhport); } else { handle_ep0_out(rhport); }
    } else if (is_in) {
      handle_ep_in(rhport, ep_num);
    } else {
      handle_ep_out(rhport, ep_num);
    }
  }
}

//--------------------------------------------------------------------+
// TIM12 fallback backstop timer (0.5 s), direct-register
//--------------------------------------------------------------------+
// TIM12's bus clock is off out of reset (RM 3.4.8 RCC_HB2PCENR.TIM12EN = 0) and is only enabled
// below - which the default build (FALLBACK=0) reaches only after 3 failed trainings. Every read
// or write of TIM12 elsewhere must be gated on this, or the shared IRQ forwarder touches an
// unclocked APB peripheral on every USBSS/LINK interrupt.
static bool tim12_clocked;

static void tim12_program(uint16_t ticks_100us) {
  RCC_HB2PeriphClockCmd(RCC_HB2Periph_TIM12, ENABLE);
  tim12_clocked = true;
  RCC_ClocksTypeDef clk;
  RCC_GetClocksFreq(&clk);
  TIM12->PSC = (uint16_t)(clk.HCLK_Frequency / 10000 - 1); // 10 kHz tick
  TIM12->ATRLR = ticks_100us - 1;
  TIM12->CNT = 0;
  TIM12->INTFR = 0;
  TIM12->DMAINTENR |= TIM_IT_Update;
  TIM12->CTLR1 |= TIM_CEN;
  NVIC_EnableIRQ(TIM12_IRQn);
}

