hathach/tinyusb/src/portable/wch/dcd_ch32h417_usb30.c
static void tim12_stop(void) {
  NVIC_DisableIRQ(TIM12_IRQn);
  if (!tim12_clocked) {
    return; // never programmed: the register writes would be dropped on the gated bus clock
  }
  TIM12->CTLR1 &= (uint16_t)~TIM_CEN;
  TIM12->DMAINTENR &= (uint16_t)~TIM_IT_Update;
}

// Rate-limit SuperSpeed retraining: after repeated training failures hold the link DISABLED for
// ~20 ms before re-entering RxDetect. Without this the LTSSM loops DISABLE->RxDetect->Polling at
// hardware speed against an unresponsive far end; the resulting interrupt storm starves the
// core-assisted SDI debug interface (and the vendor demo gates retrains behind a timer too).
static void link_backoff_arm(void) {
  backoff_armed = true;
  tim12_program(200); // 20 ms
}

#if CFG_TUD_WCH_USB30_FALLBACK
static void fallback_timer_start(bool enable) {
  if (enable) {
    tim12_program(5000); // 0.5 s
  } else {
    tim12_stop();
  }
}
#endif

static void handle_timer_irq(uint8_t rhport) {
  (void)rhport;
  if (!tim12_clocked || !(TIM12->INTFR & TIM_IT_Update)) {
    return; // the timer is only clocked once tim12_program() ran (see tim12_clocked)
  }
  TIM12->INTFR = (uint16_t)~TIM_IT_Update;
  if (backoff_armed) {
    backoff_armed = false;
    USBSSD->LINK_CTRL &= ~LINK_GO_DISABLED; // release the held link: LTSSM re-enters RxDetect
#if CFG_TUD_WCH_USB30_FALLBACK
    fallback_timer_start(fb_state == FB_USB3_TRAINING); // restore the fallback cadence
#else
    tim12_stop();
#endif
    return;
  }
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB3_TRAINING && ++fb_fail_count >= FB_FAIL_LIMIT) {
    fallback_to_usb2(rhport);
  }
#endif
}

//--------------------------------------------------------------------+
// dcd API
//--------------------------------------------------------------------+

bool dcd_init(uint8_t rhport, const tusb_rhport_init_t *rh_init) {
  (void)rhport;
  (void)rh_init;
  TU_LOG2("dcd_init: ch32h417 usb30\r\n");
  memset(&xfer_status, 0, sizeof(xfer_status));
  ep0_tx_seq = 0;
  ep0_rx_seq = 0;
  pending_addr_valid = false;
  ep0_status_done = false;
  retrain_fail = 0;
  backoff_armed = false;
  link_low_power = false;
  link_suspended = false;
  link_established = false;

#if CFG_TUD_WCH_USB30_FALLBACK
  fb_state = FB_USB3_TRAINING;
  fb_fail_count = 0;
  ch32h417_usb2_deinit(); // quiesce a USB2 controller a prior fallback may have left up
#endif

  usbss_device_init(true);

#if CFG_TUD_WCH_USB30_FALLBACK
  fallback_timer_start(true);
#endif
  return true;
}

bool dcd_deinit(uint8_t rhport) {
  (void)rhport;
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) {
    // the USB2 controller took the port during fallback: tear that down instead
    ch32h417_usb2_int_disable();
    ch32h417_usb2_deinit();
    return true;
  }
#endif
  // Mask first, then tear down: a LINK DISABLE/INACTIVE event or a timer expiry taken between the
  // state updates below still runs the fallback ladder, which would bring the USB2 controller up
  // on a port that is being deinitialized (tud_deinit() returning with the device still attached).
  dcd_int_disable(rhport);
  backoff_armed = false;
  tim12_stop();             // stop the retrain-backoff / fallback backstop timer + mask TIM12 IRQ
  usbss_device_init(false); // gate USBSS clocks and disable the USBSS/LINK IRQs
  return true;
}

void dcd_int_handler(uint8_t rhport) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) {
    ch32h417_usb2_int_handler(rhport);
    return;
  }
#endif
  handle_timer_irq(rhport); // retrain backoff (and, when enabled, the USB2-fallback ladder)
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) {
    return;
  }
#endif
  if (USBSSD->LINK_INT_FLAG & USBSSD->LINK_INT_CTRL) {
    handle_link_irq(rhport);
#if CFG_TUD_WCH_USB30_FALLBACK
    if (fb_state == FB_USB2_ACTIVE) {
      return; // handle_link_irq fell back to USB2: USBSS clocks are gated, do not touch it
    }
#endif
  }
  if (USBSSD->USB_STATUS & (USBSS_UIF_TRANSFER | USBSS_UDIF_SETUP | USBSS_UDIF_STATUS)) {
    handle_usb_irq(rhport);
  }
}

void dcd_int_enable(uint8_t rhport) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) { ch32h417_usb2_int_enable(); return; }
#endif
  (void)rhport;
  NVIC_EnableIRQ(USBSS_IRQn);
  NVIC_EnableIRQ(USBSS_LINK_IRQn);
  NVIC_EnableIRQ(TIM12_IRQn); // retrain-backoff / fallback backstop timer (symmetric with disable)
}

void dcd_int_disable(uint8_t rhport) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) { ch32h417_usb2_int_disable(); return; }
#endif
  (void)rhport;
  NVIC_DisableIRQ(USBSS_IRQn);
  NVIC_DisableIRQ(USBSS_LINK_IRQn);
  NVIC_DisableIRQ(TIM12_IRQn); // mask the timer too, so no timer IRQ fires after tud_deinit
}

void dcd_set_address(uint8_t rhport, uint8_t dev_addr) {
  (void)dev_addr;
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) {
    // USB2 applies the address in ch32h417_usb2_edpt0_status_complete (called by usbd with the
    // real request); here just arm the status ZLP on the USB2 controller.
    ch32h417_usb2_edpt_xfer(rhport, 0x80, NULL, 0);
    return;
  }
#endif
  // SuperSpeed: apply the address at the status stage (USBSS_UDIF_STATUS), per the SIE
  pending_addr = dev_addr;
  pending_addr_valid = true;
  dcd_edpt_xfer(rhport, 0x80, NULL, 0, false); // ZLP status
}

void dcd_remote_wakeup(uint8_t rhport) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) {
    ch32h417_usb2_remote_wakeup(); // USB2 owns the port (USBSS clocks are gated): resume from there
    return;
  }
#endif
  (void)rhport;
  USBSSD->LINK_CTRL |= LINK_TX_UX_EXIT; // best effort U-state exit
}

void dcd_disconnect(uint8_t rhport) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) {
    ch32h417_usb2_disconnect();
    return;
  }
#endif
  // Mask the USBSS/LINK/TIM12 vectors BEFORE gating USBSS clocks: the aliased TIM12 IRQ would
  // otherwise fire dcd_int_handler, which reads clock-gated USBSSD registers, and a LINK event or
  // timer expiry landing mid-teardown would run the fallback ladder and re-attach as USB2 right
  // after the application asked to disconnect. dcd_connect re-enables them (usbss_device_init /
  // tim12_program).
  dcd_int_disable(rhport);
  backoff_armed = false;
  tim12_stop();
  usbss_device_init(false); // drop RX terminations + gate clocks: the host sees a disconnect
}

void dcd_connect(uint8_t rhport) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) {
    ch32h417_usb2_connect();
    return;
  }
#endif
  (void)rhport;
#if CFG_TUD_WCH_USB30_FALLBACK
  fb_state = FB_USB3_TRAINING; // restart the training/fallback ladder alongside the link
  fb_fail_count = 0;
#endif
  usbss_device_init(true); // restore terminations and restart link training
#if CFG_TUD_WCH_USB30_FALLBACK
  fallback_timer_start(true);
#endif
}

