hathach/tinyusb/src/portable/wch/dcd_ch32h417_usb30.c
void dcd_sof_enable(uint8_t rhport, bool en) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) {
    ch32h417_usb2_sof_enable(rhport, en);
    return;
  }
#endif
  (void)rhport;
  (void)en; // no frame interrupt at SuperSpeed (ITP is ignored)
}

void dcd_edpt0_status_complete(uint8_t rhport, const tusb_control_request_t *request) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) { ch32h417_usb2_edpt0_status_complete(rhport, request); return; }
#endif
  (void)rhport;
  // Track the host's U1/U2 enable in the link layer: the LTSSM answers LGO_U1/LGO_U2 with LXU
  // (deny) unless the matching ALLOW bit is set (RM 27.2.6.2, reset 0), so without this the link
  // refuses what usbd reports as enabled in GET_STATUS and the U1/U2 handling above is dead code.
  // Applied at the status stage, i.e. only for a request usbd actually accepted.
  if (request->bmRequestType == 0 &&
      (request->bRequest == TUSB_REQ_SET_FEATURE || request->bRequest == TUSB_REQ_CLEAR_FEATURE)) {
    uint32_t allow = 0;
    if (request->wValue == TUSB_REQ_FEATURE_U1_ENABLE) {
      allow = LINK_U1_ALLOW;
    } else if (request->wValue == TUSB_REQ_FEATURE_U2_ENABLE) {
      allow = LINK_U2_ALLOW;
    }
    if (allow) {
      if (request->bRequest == TUSB_REQ_SET_FEATURE) {
        USBSSD->LINK_CFG |= allow;
      } else {
        USBSSD->LINK_CFG &= ~allow;
      }
    }
  }
}

bool dcd_edpt_open(uint8_t rhport, const tusb_desc_endpoint_t *desc_edpt) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) { return ch32h417_usb2_edpt_open(rhport, desc_edpt); }
#endif
  (void)rhport;
  const uint8_t ep_num = tu_edpt_number(desc_edpt->bEndpointAddress);
  const tusb_dir_t dir = tu_edpt_dir(desc_edpt->bEndpointAddress);
  TU_ASSERT(ep_num < EP_MAX);
  if (ep_num == 0) {
    return true;
  }

  xfer_ctl_t *xfer = XFER_CTL_BASE(ep_num, dir);
  xfer->max_size = tu_edpt_packet_size(desc_edpt);
  TU_ASSERT(xfer->max_size <= 1024); // rx_bounce rows are 1024 B (SS caps wMaxPacketSize at 1024)
  xfer->is_iso = (desc_edpt->bmAttributes.xfer == TUSB_XFER_ISOCHRONOUS);

  if (dir == TUSB_DIR_IN) {
    volatile USBSS_EP_TX_TypeDef *tx = usbss_ep_tx(ep_num);
    // EOB_MODE=1 (RM 27.2.3.1 bit3) selects the short-packet EOB polarity. The RM text reads
    // inverted (translation): measured on silicon, at the reset default (0) a short DP carries
    // NO EOB/LPF - the only source is a CHAIN_ST.EOB_LPF latch written after the arm, which
    // races the departing DP on a hot link (lost race = burst left open, host EPROTOs the next
    // IN, and the orphaned latch poisons the following chain - MSC short responses wedged the
    // endpoint). With 1 the hw auto-tags EOB on short packets and no latch is needed.
    tx->UEP_TX_CFG = USBSS_EP_TX_CHAIN_AUTO | USBSS_EP_TX_ERDY_AUTO | USBSS_EP_TX_SEQ_AUTO |
                     USBSS_EP_TX_EOB_MODE |
                     (xfer->is_iso ? USBSS_EP_TX_ISO_MODE : 0);
    tx->UEP_TX_CR = (uint8_t)(USBSS_EP_TX_CLR | USBSS_EP_TX_CHAIN_CLR);
    // TX ERDY window = chain depth (the vendor leaves TX_CR at its 0x10 reset). A NumP-1
    // window costs an ERDY TP per DP; with two IN endpoints streaming, that per-DP TP pressure
    // is what the shared TP machinery cannot take (same failure family as the CH569's one-shot
    // USB_FC_CTRL mailbox). The descriptor's bMaxBurst stays CFG_TUD_WCH_USB30_MAX_BURST-1 and
    // the host clamps its side to that.
    tx->UEP_TX_CR = TX_CHAIN_MAX_PKTS;
    USBSSD->UEP_TX_EN |= (uint16_t)(1u << ep_num);
  } else {
    volatile USBSS_EP_RX_TypeDef *rx = usbss_ep_rx(ep_num);
    rx->UEP_RX_CFG = USBSS_EP_RX_CHAIN_AUTO | USBSS_EP_RX_ERDY_AUTO | USBSS_EP_RX_SEQ_AUTO |
                     (xfer->is_iso ? USBSS_EP_RX_ISO_MODE : 0);
    rx->UEP_RX_CR = (uint8_t)(USBSS_EP_RX_CLR | USBSS_EP_RX_CHAIN_CLR);
    rx->UEP_RX_CR = CFG_TUD_WCH_USB30_MAX_BURST;
    USBSSD->UEP_RX_EN |= (uint16_t)(1u << ep_num);
  }
  return true;
}

void dcd_edpt_close(uint8_t rhport, uint8_t ep_addr) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) { ch32h417_usb2_edpt_close(rhport, ep_addr); return; }
#endif
  (void)rhport;
  const uint8_t ep_num = tu_edpt_number(ep_addr);
  const tusb_dir_t dir = tu_edpt_dir(ep_addr);
  if (ep_num == 0) {
    return; // EP0 has no bank of its own: usbss_ep_tx(0)/usbss_ep_rx(0) index BEFORE EP1's
  }
  if (dir == TUSB_DIR_IN) {
    usbss_ep_tx(ep_num)->UEP_TX_CR = (uint8_t)(USBSS_EP_TX_CLR | USBSS_EP_TX_CHAIN_CLR);
    USBSSD->UEP_TX_EN &= (uint16_t)~(1u << ep_num);
  } else {
    usbss_ep_rx(ep_num)->UEP_RX_CR = (uint8_t)(USBSS_EP_RX_CLR | USBSS_EP_RX_CHAIN_CLR);
    USBSSD->UEP_RX_EN &= (uint16_t)~(1u << ep_num);
  }
  XFER_CTL_BASE(ep_num, dir)->valid = false;
}

void dcd_edpt_close_all(uint8_t rhport) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) { ch32h417_usb2_edpt_close_all(rhport); return; }
#endif
  (void)rhport;
  for (uint8_t ep = 1; ep < EP_MAX; ep++) {
    usbss_ep_tx(ep)->UEP_TX_CR = (uint8_t)(USBSS_EP_TX_CLR | USBSS_EP_TX_CHAIN_CLR);
    usbss_ep_rx(ep)->UEP_RX_CR = (uint8_t)(USBSS_EP_RX_CLR | USBSS_EP_RX_CHAIN_CLR);
    xfer_status[ep][0].valid = false;
    xfer_status[ep][1].valid = false;
  }
  USBSSD->UEP_TX_EN = 0;
  USBSSD->UEP_RX_EN = 0;
}

bool dcd_edpt_xfer(uint8_t rhport, uint8_t ep_addr, uint8_t *buffer, uint16_t total_bytes, bool is_isr) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) { return ch32h417_usb2_edpt_xfer(rhport, ep_addr, buffer, total_bytes); }
#endif
  const uint8_t ep_num = tu_edpt_number(ep_addr);
  const tusb_dir_t dir = tu_edpt_dir(ep_addr);

  xfer_ctl_t *xfer = XFER_CTL_BASE(ep_num, dir);
  xfer->buffer = buffer;
  xfer->total_len = total_bytes;
  xfer->queued_len = 0;
  xfer->valid = true;

  if (ep_num == 0) {
    TU_LOG2("X0: %c%u\r\n", dir == TUSB_DIR_IN ? 'I' : 'O', total_bytes);
    if (total_bytes == 0) {
      // Status-stage ZLP (either direction). If the controller already ran the status stage
      // (UDIF_STATUS fired before usbd queued this - the host pipelines control transfers faster
      // than the task loop), complete immediately and touch NO hardware: a stale EP0 arm would
      // leak into the next control transfer and break it.
      if (ep0_status_done) {
        ep0_status_done = false;
        if (pending_addr_valid) { // SET_ADDRESS whose status stage already ran: latch it now
          USBSSD->USB_CONTROL = (USBSSD->USB_CONTROL & 0x00FFFFFF) | ((uint32_t)pending_addr << 24);
          pending_addr_valid = false;
        }
        // park both EP0 registers: their ACT completion flags (bit 31) write-lock all later arms
        USBSSD->UEP0_TX_CTRL = 0;
        USBSSD->UEP0_RX_CTRL = 0;
        xfer->valid = false;
        // synchronous completion: forward the caller's context so the FreeRTOS queue send matches
        dcd_event_xfer_complete(rhport, ep_addr, 0, XFER_RESULT_SUCCESS, is_isr);
      } else if (dir == TUSB_DIR_IN) {
        // control-OUT/no-data: the device transmits the status ZLP - needs the TX arm
        // (clear first: a set ACT flag write-locks the register). UDIF_STATUS completes it.
        ep0_arm_in(0);
        ep0_arm_out();
      } else {
        // control-IN status (OUT ZLP): the RX was pre-armed in handle_ep0_in and the controller
        // accepts the ZLP with NO completion interrupt (neither UDIF_STATUS nor UIF_TRANSFER fires
        // - proven on hardware: every second control transfer died with the event-driven design).
        // Complete it immediately; the FIFO event queue keeps ordering correct for usbd.
        xfer->valid = false;
        dcd_event_xfer_complete(rhport, ep_addr, 0, XFER_RESULT_SUCCESS, is_isr);
      }
    } else if (dir == TUSB_DIR_IN) {
      handle_ep0_in(rhport);
    } else {
      ep0_arm_out(); // control-OUT data stage
    }
  } else if (dir == TUSB_DIR_IN) {
    queue_in_packet(ep_num, xfer);
  } else {
    queue_out_packet(ep_num, xfer);
  }
  return true;
}

void dcd_edpt_stall(uint8_t rhport, uint8_t ep_addr) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) { ch32h417_usb2_edpt_stall(rhport, ep_addr); return; }
#endif
  (void)rhport;
  const uint8_t ep_num = tu_edpt_number(ep_addr);
  const tusb_dir_t dir = tu_edpt_dir(ep_addr);
  if (ep_num == 0) {
    USBSSD->UEP0_TX_CTRL = 0; // clear the ACT write-locks first
    USBSSD->UEP0_RX_CTRL = 0;
    USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_STALL;
    USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_STALL;
  } else if (dir == TUSB_DIR_IN) {
    volatile USBSS_EP_TX_TypeDef *tx = usbss_ep_tx(ep_num);
    // Clear the armed CHAIN only - never RB_EP_TX_CLR, which resets the whole endpoint (RM
    // 27.2.3.2: "clear all configuration values and states of endpoints except UEP_CFG"). A
    // TX_CLR'd endpoint stops emitting a valid STALL TP: the host xHC reports a USB Transaction
    // Error on every IN to the halted endpoint (-EPROTO, never -EPIPE) and resets the device.
    // MSC's BOT case-5 stall (Hi > Di) turned every short SCSI read into a usb-storage reset
    // storm. The vendor demo only ORs in HALT; keep ERDY_NUMP across both writes.
    tx->UEP_TX_CR = (uint8_t)(USBSS_EP_TX_CHAIN_CLR | TX_CHAIN_MAX_PKTS);
    tx->UEP_TX_CR = (uint8_t)(USBSS_EP_TX_HALT | TX_CHAIN_MAX_PKTS);
  } else {
    volatile USBSS_EP_RX_TypeDef *rx = usbss_ep_rx(ep_num);
    // Same rule as TX above: clear only the armed CHAIN, never RB_EP_RX_CLR (endpoint-wide reset
    // per RM 27.2.3.5) - a CLR'd endpoint answers OUT DPs with transaction errors instead of a
    // STALL TP (usbtest case 13 failed its first OUT halt this way).
    rx->UEP_RX_CR = (uint8_t)(USBSS_EP_RX_CHAIN_CLR | CFG_TUD_WCH_USB30_MAX_BURST);
    rx->UEP_RX_CR = (uint8_t)(USBSS_EP_RX_HALT | CFG_TUD_WCH_USB30_MAX_BURST);
  }
}

void dcd_edpt_clear_stall(uint8_t rhport, uint8_t ep_addr) {
#if CFG_TUD_WCH_USB30_FALLBACK
  if (fb_state == FB_USB2_ACTIVE) { ch32h417_usb2_edpt_clear_stall(rhport, ep_addr); return; }
#endif
  (void)rhport;
  const uint8_t ep_num = tu_edpt_number(ep_addr);
  const tusb_dir_t dir = tu_edpt_dir(ep_addr);
  if (ep_num == 0) {
    return;
  }
  // Do NOT re-queue the in-flight transfer here. usbd clears BUSY *and* CLAIMED on a was-stalled
  // clear (see clear_mask in usbd_edpt_clear_stall), so the transfer is retired and the class
  // owns resubmission - and vendord_abort_ep() is literally stall()+clear_stall() used to abort
  // on every SET_INTERFACE. Re-queueing resurrected that chain: it sent stale data, and its
  // completion was accounted against whatever the class armed next.
  if (dir == TUSB_DIR_IN) {
    volatile USBSS_EP_TX_TypeDef *tx = usbss_ep_tx(ep_num);
    tx->UEP_TX_CR = (uint8_t)(USBSS_EP_TX_CLR | USBSS_EP_TX_CHAIN_CLR);
    tx->UEP_TX_CR = TX_CHAIN_MAX_PKTS;
    XFER_CTL_BASE(ep_num, TUSB_DIR_IN)->valid = false;
  } else {
    volatile USBSS_EP_RX_TypeDef *rx = usbss_ep_rx(ep_num);
    rx->UEP_RX_CR = (uint8_t)(USBSS_EP_RX_CLR | USBSS_EP_RX_CHAIN_CLR);
    rx->UEP_RX_CR = CFG_TUD_WCH_USB30_MAX_BURST;
    XFER_CTL_BASE(ep_num, TUSB_DIR_OUT)->valid = false;
  }
}

#endif
